app/views/publics/_mini_shoe.html.haml

SELECT "shoes".* FROM "shoes" WHERE (enterprise_id=15)
---
    = simple_format(mini_shoe.category.name)
    %span.shoe_value= number_to_currency(mini_shoe.value)