app/views/publics/_releases.html.haml

SELECT "shoes".* FROM "shoes" ORDER BY random()
---
    %br
    %span.shoe_value= number_to_currency(releases.value)