app/views/publics/order.html.haml

%ul#order_items
  - for item in @order.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 388