app/controllers/enterprises_controller.rb

  def index
    @enterprises = Enterprise.all
---
SELECT "enterprises".* FROM "enterprises"

  def show
    @enterprise = Enterprise.find(params[:id])
---
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", "16"]]

  def edit
    @enterprise = Enterprise.find(params[:id])
---
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", "16"]]

  def update
    @enterprise = Enterprise.find(params[:id])

    respond_to do |format|
      if @enterprise.update_attributes(params[:enterprise])
---
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "enterprises" SET "email" = 'treicy.bootcamp@clickjogos.com.br', "permit" = 'f', "updated_at" = '2013-08-27 15:19:13.287718' WHERE "enterprises"."id" = 16

  def destroy
    @enterprise = Enterprise.find(params[:id])
    @enterprise.destroy
---
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", "14"]]
DELETE FROM "enterprises" WHERE "enterprises"."id" = ?  [["id", 14]]