app/controllers/publics_controller.rb

  def index
    flash[:notice] = '#{params[:redirect]} não encontrado' if params[:redirect]
    @shoes = Shoe.order('random()').all
    @enterprises = Enterprise.order("name ASC").all
    @releases = Shoe.order("created_at DESC").first(4)
---
SELECT "shoes".* FROM "shoes" ORDER BY created_at DESC
SELECT "enterprises".* FROM "enterprises" ORDER BY name ASC
SELECT "shoes".* FROM "shoes" ORDER BY created_at DESC LIMIT 5

  def buyers
    @client = Client.new
    if request.post?
      @client = Client.new(params[:client])
      if !@client.save
---
INSERT INTO "clients" ("address", "city", "cpf", "created_at", "district", "email", "name", "number", "password", "state", "telephone", "updated_at", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def sellers
    @enterprise = Enterprise.new
    if request.post?
      @enterprise = Enterprise.new(params[:enterprise])
      if !@enterprise.save
---
INSERT INTO "enterprises" ("address", "city", "cnpj", "created_at", "district", "email", "name", "name_social", "number", "password", "permit", "state", "telephone", "updated_at", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def shoe
    @enterprises = Enterprise.order("name ASC").all
  	@shoe = Shoe.find(params[:id]) rescue nil
---
SELECT "enterprises".* FROM "enterprises" ORDER BY name ASC
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "42"]]

  def enterprise
    @enterprises = Enterprise.order("name ASC").all
		@enterprise = Enterprise.find(params[:id]) rescue nil
---
SELECT "enterprises".* FROM "enterprises" ORDER BY name ASC
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", "15"]]

  def buy
    @shoe = Shoe.find(params[:id]) rescue nil
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "42"]]

  def cart
    @cart = find_cart
    @shoes = Shoe.page(params[:page]).per(4).order("created_at DESC")
---
SELECT "shoes".* FROM "shoes" ORDER BY created_at DESC LIMIT 4 OFFSET 4
SELECT COUNT(*) FROM "shoes"

  def remove
    @shoe = Shoe.find(params[:id]) rescue nil
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "40"]]

  def editar_empresa
    @enterprise = Enterprise.find(session[:id])
    if request.put?
      flash[:notice] = 'Dados atualizados' if @enterprise.update_attributes(params[:enterprise])
---
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "enterprises" SET "telephone" = '01836414382', "updated_at" = '2013-08-28 17:22:49.795349' WHERE "enterprises"."id" = 19

  def editar_cliente
    @client = Client.find(session[:id])
    if request.put?
      flash[:notice] = 'Dados atualizados' if @client.update_attributes(params[:client])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "clients" SET "email" = 'treicy.bootcamp@clickjogos.com.br', "updated_at" = '2013-08-27 20:38:16.343492' WHERE "clients"."id" = 5

  def order
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "388"]]