app/controllers/publics_controller.rb

SELECT "shoes".* FROM "shoes" WHERE (enterprise_id=15)
---
  def load_shoes
    @shoes = Shoe.permited.order('random()').first(12)

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 388
---
  def load_orders
    @orders = OrderItem.all