app/controllers/shoes_controller.rb

SELECT "shoes".* FROM "shoes" ORDER BY enterprise_id.name ASC
SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", 16]]
---
  def index
    @shoes = session[:admin] ? Shoe.all : Shoe.by_enterprise(session[:id])
    @enterprise = Enterprise.find(session[:id]) rescue nil

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "44"]]
---
  def show
    @shoe = Shoe.find(params[:id])

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "40"]]
---
  def edit
    @shoe = Shoe.find(params[:id])

INSERT INTO "shoes" ("audience", "created_at", "description", "enterprise_id", "lock_version", "name", "permit", "registed", "stock", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @shoe = currentEnterprise.shoes.new(params[:shoe])
    @shoe.save

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "40"]]
UPDATE "shoes" SET "stock" = 0, "updated_at" = '2013-08-28 12:54:26.041736', "lock_version" = 8 WHERE ("shoes"."id" = 40 AND "shoes"."lock_version" = 7)
---
  def update
    @shoe = Shoe.find(params[:id])

    respond_to do |format|
      if @shoe.update_attributes(params[:shoe])

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "46"]]
---
  def destroy
    @shoe = Shoe.find(params[:id])